{"format": "layers-model", "generatedBy": "keras v2.15.0", "convertedBy": "TensorFlow.js Converter v4.16.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 224, 224, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "keras_layer_input"}}, {"class_name": "KerasLayer", "config": {"name": "keras_layer", "trainable": false, "dtype": "float32", "handle": "/kaggle/input/mobilenet-v2/tensorflow2/140-224-classification/2"}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [1], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "gamma_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "moving_mean_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "moving_variance_initializer": {"module": "keras.initializers", "class_name": "Ones", "config": {}, "registered_name": null}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 36, "activation": "softmax", "use_bias": true, "kernel_initializer": {"module": "keras.initializers", "class_name": "GlorotUniform", "config": {"seed": null}, "registered_name": null}, "bias_initializer": {"module": "keras.initializers", "class_name": "Zeros", "config": {}, "registered_name": null}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": {"class_name": "CategoricalCrossentropy", "config": {"reduction": "auto", "name": "categorical_crossentropy", "from_logits": false, "label_smoothing": 0.0, "axis": -1, "fn": "categorical_crossentropy"}}, "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": true, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [1001], "dtype": "float32"}, {"name": "batch_normalization/beta", "shape": [1001], "dtype": "float32"}, {"name": "batch_normalization/moving_mean", "shape": [1001], "dtype": "float32"}, {"name": "batch_normalization/moving_variance", "shape": [1001], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1001, 36], "dtype": "float32"}, {"name": "dense/bias", "shape": [36], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/depthwise/depthwise_weights", "shape": [3, 3, 1344, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/expand/weights", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/project/weights", "shape": [1, 1, 288, 48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/project/weights", "shape": [1, 1, 288, 88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/depthwise/BatchNorm/gamma", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/depthwise/BatchNorm/gamma", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/expand/BatchNorm/beta", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/expand/BatchNorm/beta", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/Conv/weights", "shape": [3, 3, 3, 48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/expand/BatchNorm/gamma", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/project/BatchNorm/beta", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/project/weights", "shape": [1, 1, 528, 88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/depthwise/depthwise_weights", "shape": [3, 3, 816, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/expand/BatchNorm/beta", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/depthwise/BatchNorm/beta", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/depthwise/BatchNorm/gamma", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/project/weights", "shape": [1, 1, 192, 32], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/project/weights", "shape": [1, 1, 288, 48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/expand/BatchNorm/gamma", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/expand/weights", "shape": [1, 1, 88, 528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/project/weights", "shape": [1, 1, 528, 88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv/depthwise/BatchNorm/beta", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/depthwise/BatchNorm/beta", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/expand/weights", "shape": [1, 1, 48, 288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/depthwise/BatchNorm/gamma", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/depthwise/depthwise_weights", "shape": [3, 3, 1344, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/project/BatchNorm/beta", "shape": [224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/expand/BatchNorm/beta", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/Logits/Conv2d_1c_1x1/biases", "shape": [1001], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/project/weights", "shape": [1, 1, 816, 224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/expand/BatchNorm/gamma", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/project/BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/project/BatchNorm/gamma", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/project/BatchNorm/beta", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/expand/weights", "shape": [1, 1, 24, 144], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/project/BatchNorm/gamma", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/depthwise/BatchNorm/beta", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/expand/BatchNorm/gamma", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/project/BatchNorm/gamma", "shape": [224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/project/BatchNorm/beta", "shape": [224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/expand/BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/project/BatchNorm/gamma", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/depthwise/depthwise_weights", "shape": [3, 3, 288, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/expand/BatchNorm/beta", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/expand/weights", "shape": [1, 1, 88, 528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/project/BatchNorm/gamma", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/expand/weights", "shape": [1, 1, 88, 528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv/depthwise/BatchNorm/gamma", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/depthwise/BatchNorm/gamma", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/depthwise/depthwise_weights", "shape": [3, 3, 528, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/depthwise/BatchNorm/gamma", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/depthwise/BatchNorm/beta", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/depthwise/BatchNorm/beta", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/Conv_1/weights", "shape": [1, 1, 448, 1792], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/depthwise/BatchNorm/beta", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/expand/BatchNorm/beta", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/depthwise/depthwise_weights", "shape": [3, 3, 1344, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/project/BatchNorm/gamma", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/depthwise/BatchNorm/beta", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/depthwise/BatchNorm/beta", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/expand/weights", "shape": [1, 1, 48, 288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/expand/BatchNorm/gamma", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/depthwise/BatchNorm/beta", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/depthwise/BatchNorm/beta", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/expand/BatchNorm/beta", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/Conv/BatchNorm/beta", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/expand/BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/depthwise/BatchNorm/beta", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/expand/weights", "shape": [1, 1, 88, 528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/depthwise/depthwise_weights", "shape": [3, 3, 528, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/project/BatchNorm/gamma", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/project/BatchNorm/beta", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/project/weights", "shape": [1, 1, 192, 48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/expand/weights", "shape": [1, 1, 32, 192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/depthwise/depthwise_weights", "shape": [3, 3, 528, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/project/BatchNorm/beta", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/expand/BatchNorm/gamma", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/expand/BatchNorm/gamma", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/project/BatchNorm/beta", "shape": [448], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/expand/BatchNorm/gamma", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/expand/BatchNorm/beta", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/expand/BatchNorm/beta", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv/project/BatchNorm/gamma", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV2/Conv/BatchNorm/gamma", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/project/BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/project/BatchNorm/beta", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/project/weights", "shape": [1, 1, 528, 136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/depthwise/BatchNorm/gamma", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/depthwise/BatchNorm/gamma", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/depthwise/depthwise_weights", "shape": [3, 3, 816, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/expand/BatchNorm/gamma", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/depthwise/BatchNorm/gamma", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/expand/BatchNorm/gamma", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/expand/BatchNorm/beta", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/project/BatchNorm/gamma", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/expand/BatchNorm/gamma", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/project/BatchNorm/beta", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/depthwise/depthwise_weights", "shape": [3, 3, 528, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/project/BatchNorm/beta", "shape": [224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/depthwise/depthwise_weights", "shape": [3, 3, 288, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/depthwise/BatchNorm/beta", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/depthwise/depthwise_weights", "shape": [3, 3, 816, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/project/weights", "shape": [1, 1, 816, 136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/project/weights", "shape": [1, 1, 1344, 224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/expand/BatchNorm/gamma", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/project/weights", "shape": [1, 1, 1344, 224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/project/BatchNorm/gamma", "shape": [448], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/depthwise/depthwise_weights", "shape": [3, 3, 144, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/project/weights", "shape": [1, 1, 528, 88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/depthwise/BatchNorm/beta", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/expand/weights", "shape": [1, 1, 136, 816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/project/BatchNorm/beta", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/expand/BatchNorm/gamma", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/project/BatchNorm/gamma", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/project/weights", "shape": [1, 1, 816, 136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/project/BatchNorm/beta", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV2/Logits/Conv2d_1c_1x1/weights", "shape": [1, 1, 1792, 1001], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/expand/weights", "shape": [1, 1, 224, 1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/depthwise/BatchNorm/gamma", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/project/weights", "shape": [1, 1, 144, 32], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/depthwise/BatchNorm/gamma", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/depthwise/depthwise_weights", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/depthwise/BatchNorm/gamma", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/depthwise/depthwise_weights", "shape": [3, 3, 288, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/depthwise/BatchNorm/gamma", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/project/BatchNorm/gamma", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/project/BatchNorm/beta", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/Conv_1/BatchNorm/beta", "shape": [1792], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv/depthwise/depthwise_weights", "shape": [3, 3, 48, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/depthwise/depthwise_weights", "shape": [3, 3, 192, 1], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/project/BatchNorm/gamma", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/depthwise/BatchNorm/gamma", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/depthwise/BatchNorm/gamma", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/project/BatchNorm/gamma", "shape": [224], "dtype": "float32"}, {"name": "MobilenetV2/Conv_1/BatchNorm/gamma", "shape": [1792], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/expand/BatchNorm/beta", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/expand/BatchNorm/gamma", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/expand/weights", "shape": [1, 1, 136, 816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/depthwise/BatchNorm/beta", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/expand/BatchNorm/beta", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/depthwise/BatchNorm/gamma", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv/project/BatchNorm/beta", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/depthwise/BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/depthwise/BatchNorm/beta", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/expand/BatchNorm/gamma", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/project/BatchNorm/gamma", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/project/BatchNorm/gamma", "shape": [224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/expand/weights", "shape": [1, 1, 48, 288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/expand/weights", "shape": [1, 1, 224, 1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/expand/BatchNorm/beta", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv/project/weights", "shape": [1, 1, 48, 24], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/project/BatchNorm/beta", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/expand/BatchNorm/beta", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/project/BatchNorm/beta", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/expand/weights", "shape": [1, 1, 136, 816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/expand/BatchNorm/gamma", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/expand/weights", "shape": [1, 1, 224, 1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/project/weights", "shape": [1, 1, 1344, 448], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/project/BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/project/BatchNorm/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/project/BatchNorm/moving_variance", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/expand/BatchNorm/moving_variance", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/expand/BatchNorm/moving_variance", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/depthwise/BatchNorm/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/depthwise/BatchNorm/moving_mean", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/depthwise/BatchNorm/moving_variance", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/depthwise/BatchNorm/moving_variance", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/project/BatchNorm/moving_mean", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV2/Conv/BatchNorm/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/project/BatchNorm/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/project/BatchNorm/moving_mean", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/depthwise/BatchNorm/moving_variance", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/expand/BatchNorm/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/expand/BatchNorm/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/depthwise/BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/expand/BatchNorm/moving_mean", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/expand/BatchNorm/moving_mean", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/project/BatchNorm/moving_mean", "shape": [448], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/project/BatchNorm/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/project/BatchNorm/moving_variance", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/expand/BatchNorm/moving_variance", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/depthwise/BatchNorm/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/depthwise/BatchNorm/moving_variance", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/depthwise/BatchNorm/moving_variance", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/depthwise/BatchNorm/moving_variance", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/expand/BatchNorm/moving_variance", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/project/BatchNorm/moving_mean", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/project/BatchNorm/moving_variance", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/expand/BatchNorm/moving_variance", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/expand/BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/expand/BatchNorm/moving_mean", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/expand/BatchNorm/moving_mean", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/depthwise/BatchNorm/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/expand/BatchNorm/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/depthwise/BatchNorm/moving_variance", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv/project/BatchNorm/moving_mean", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/project/BatchNorm/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/expand/BatchNorm/moving_variance", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/depthwise/BatchNorm/moving_mean", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/depthwise/BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/depthwise/BatchNorm/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/depthwise/BatchNorm/moving_variance", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/expand/BatchNorm/moving_mean", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/expand/BatchNorm/moving_mean", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/project/BatchNorm/moving_mean", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/project/BatchNorm/moving_variance", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/expand/BatchNorm/moving_variance", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/expand/BatchNorm/moving_mean", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/expand/BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/depthwise/BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/project/BatchNorm/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/expand/BatchNorm/moving_variance", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/depthwise/BatchNorm/moving_mean", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/depthwise/BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/depthwise/BatchNorm/moving_variance", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/project/BatchNorm/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/project/BatchNorm/moving_mean", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/project/BatchNorm/moving_variance", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_16/project/BatchNorm/moving_variance", "shape": [448], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/expand/BatchNorm/moving_mean", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv/depthwise/BatchNorm/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/expand/BatchNorm/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/expand/BatchNorm/moving_mean", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_2/project/BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/project/BatchNorm/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/expand/BatchNorm/moving_variance", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/depthwise/BatchNorm/moving_mean", "shape": [144], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/depthwise/BatchNorm/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/project/BatchNorm/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/depthwise/BatchNorm/moving_mean", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_9/project/BatchNorm/moving_variance", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/expand/BatchNorm/moving_variance", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/project/BatchNorm/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/expand/BatchNorm/moving_variance", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/depthwise/BatchNorm/moving_mean", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/expand/BatchNorm/moving_mean", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/project/BatchNorm/moving_mean", "shape": [224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/project/BatchNorm/moving_mean", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/expand/BatchNorm/moving_mean", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/Conv_1/BatchNorm/moving_mean", "shape": [1792], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_1/project/BatchNorm/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_6/expand/BatchNorm/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/depthwise/BatchNorm/moving_mean", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/depthwise/BatchNorm/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/project/BatchNorm/moving_mean", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/project/BatchNorm/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "MobilenetV2/Conv/BatchNorm/moving_variance", "shape": [48], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_8/project/BatchNorm/moving_variance", "shape": [88], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_11/depthwise/BatchNorm/moving_variance", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/expand/BatchNorm/moving_variance", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_7/depthwise/BatchNorm/moving_mean", "shape": [528], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_12/depthwise/BatchNorm/moving_mean", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_15/depthwise/BatchNorm/moving_mean", "shape": [1344], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_3/expand/BatchNorm/moving_mean", "shape": [192], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_10/project/BatchNorm/moving_mean", "shape": [136], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_14/project/BatchNorm/moving_variance", "shape": [224], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_5/expand/BatchNorm/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv/project/BatchNorm/moving_variance", "shape": [24], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_13/depthwise/BatchNorm/moving_mean", "shape": [816], "dtype": "float32"}, {"name": "MobilenetV2/expanded_conv_4/depthwise/BatchNorm/moving_variance", "shape": [288], "dtype": "float32"}, {"name": "MobilenetV2/Conv_1/BatchNorm/moving_variance", "shape": [1792], "dtype": "float32"}]}]}